RT-Thread/rt-thread/bsp/nuvoton/libraries/m031/Device/Nuvoton/M031/Include/ui2c_reg.h
     * |        |          |1 = Read command be record on the address match wake-up frame.
     * |[18]    |BUSHANG   |Bus Hang-up
     * |        |          |This bit indicates bus hang-up status.
     * |        |          |There is 4-bit counter count when SCL hold high and refer fSAMP_CLK.
     * |        |          |The hang-up counter will count to overflow and set this bit when SDA is low.
     * |        |          |The counter will be reset by falling edge of SCL signal.
     * |        |          |0 = The bus is normal status for transmission.
     * |        |          |1 = The bus is hang-up status for transmission.
     * |        |          |Note: This bit has no interrupt signal, and it will be cleared automatically by hardware when a START condition is present.
     * |[19]    |ERRARBLO  |Error Arbitration Lost
     * |        |          |This bit indicates bus arbitration lost due to bigger noise which is can't be filtered by input processor.
     * |        |          |The I2C can send start condition when ERRARBLO is set.
     * |        |          |Thus this bit doesn't be cared on slave mode.
     * |        |          |0 = The bus is normal status for transmission.
     * |        |          |1 = The bus is error arbitration lost status for transmission.
     * |        |          |Note: This bit has no interrupt signal, and it will be cleared automatically by hardware when a START condition is present.
     * @var UI2C_T::ADMAT
     * Offset: 0x88  I2C Slave Match Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ADMAT0    |USCI Address 0 Match Status Register
     * |        |          |When address 0 is matched, hardware will inform which address used.
     * |        |          |This bit will set to 1, and software can write 1 to clear this bit.
     * |[1]     |ADMAT1    |USCI Address 1 Match Status Register
     * |        |          |When address 1 is matched, hardware will inform which address used.
     * |        |          |This bit will set to 1, and software can write 1 to clear this bit.
     * @var UI2C_T::TMCTL
     * Offset: 0x8C  I2C Timing Configure Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[8:0]   |STCTL     |Setup Time Configure Control
     * |        |          |This field is used to generate a delay timing between SDA edge and SCL rising edge in transmission mode.
     * |        |          |The delay setup time is numbers of peripheral clock = STCTL x fPCLK.
     * |[24:16] |HTCTL     |Hold Time Configure Control
     * |        |          |This field is used to generate the delay timing between SCL falling edge SDA edge in
     * |        |          |transmission mode.
     * |        |          |The delay hold time is numbers of peripheral clock = HTCTL x fPCLK.
     * |        |          |Note: Hold time adjust function can only work in master mode, when slave mode, this field should set as 0.
     */
    __IO uint32_t CTL;                   /*!< [0x0000] USCI Control Register                                            */
    __I  uint32_t RESERVE0[1];
    __IO uint32_t BRGEN;                 /*!< [0x0008] USCI Baud Rate Generator Register                                */
    __I  uint32_t RESERVE1[8];
    __IO uint32_t LINECTL;               /*!< [0x002c] USCI Line Control Register                                       */
    __O  uint32_t TXDAT;                 /*!< [0x0030] USCI Transmit Data Register                                      */
    __I  uint32_t RXDAT;                 /*!< [0x0034] USCI Receive Data Register                                       */
    __I  uint32_t RESERVE2[3];
    __IO uint32_t DEVADDR0;              /*!< [0x0044] USCI Device Address Register 0                                   */
    __IO uint32_t DEVADDR1;              /*!< [0x0048] USCI Device Address Register 1                                   */
    __IO uint32_t ADDRMSK0;              /*!< [0x004c] USCI Device Address Mask Register 0                              */
    __IO uint32_t ADDRMSK1;              /*!< [0x0050] USCI Device Address Mask Register 1                              */
    __IO uint32_t WKCTL;                 /*!< [0x0054] USCI Wake-up Control Register                                    */
    __IO uint32_t WKSTS;                 /*!< [0x0058] USCI Wake-up Status Register                                     */
    __IO uint32_t PROTCTL;               /*!< [0x005c] USCI Protocol Control Register                                   */
    __IO uint32_t PROTIEN;               /*!< [0x0060] USCI Protocol Interrupt Enable Register                          */
    __IO uint32_t PROTSTS;               /*!< [0x0064] USCI Protocol Status Register                                    */
    __I  uint32_t RESERVE3[8];
    __IO uint32_t ADMAT;                 /*!< [0x0088] I2C Slave Match Address Register                                 */
    __IO uint32_t TMCTL;                 /*!< [0x008c] I2C Timing Configure Control Register                            */

} UI2C_T;

/**
    @addtogroup UI2C_CONST UI2C Bit Field Definition
    Constant Definitions for UI2C Controller
@{ */

#define UI2C_CTL_FUNMODE_Pos          (0)                                            /*!< UI2C_T::CTL: FUNMODE Position       */
#define UI2C_CTL_FUNMODE_Msk          (0x7ul << UI2C_CTL_FUNMODE_Pos)                /*!< UI2C_T::CTL: FUNMODE Mask           */

#define UI2C_BRGEN_RCLKSEL_Pos        (0)                                            /*!< UI2C_T::BRGEN: RCLKSEL Position     */
#define UI2C_BRGEN_RCLKSEL_Msk        (0x1ul << UI2C_BRGEN_RCLKSEL_Pos)              /*!< UI2C_T::BRGEN: RCLKSEL Mask         */

#define UI2C_BRGEN_PTCLKSEL_Pos       (1)                                            /*!< UI2C_T::BRGEN: PTCLKSEL Position    */
#define UI2C_BRGEN_PTCLKSEL_Msk       (0x1ul << UI2C_BRGEN_PTCLKSEL_Pos)             /*!< UI2C_T::BRGEN: PTCLKSEL Mask        */

#define UI2C_BRGEN_SPCLKSEL_Pos       (2)                                            /*!< UI2C_T::BRGEN: SPCLKSEL Position    */
#define UI2C_BRGEN_SPCLKSEL_Msk       (0x3ul << UI2C_BRGEN_SPCLKSEL_Pos)             /*!< UI2C_T::BRGEN: SPCLKSEL Mask        */

#define UI2C_BRGEN_TMCNTEN_Pos        (4)                                            /*!< UI2C_T::BRGEN: TMCNTEN Position     */
#define UI2C_BRGEN_TMCNTEN_Msk        (0x1ul << UI2C_BRGEN_TMCNTEN_Pos)              /*!< UI2C_T::BRGEN: TMCNTEN Mask         */

#define UI2C_BRGEN_TMCNTSRC_Pos       (5)                                            /*!< UI2C_T::BRGEN: TMCNTSRC Position    */
#define UI2C_BRGEN_TMCNTSRC_Msk       (0x1ul << UI2C_BRGEN_TMCNTSRC_Pos)             /*!< UI2C_T::BRGEN: TMCNTSRC Mask        */

#define UI2C_BRGEN_PDSCNT_Pos         (8)                                            /*!< UI2C_T::BRGEN: PDSCNT Position      */
#define UI2C_BRGEN_PDSCNT_Msk         (0x3ul << UI2C_BRGEN_PDSCNT_Pos)               /*!< UI2C_T::BRGEN: PDSCNT Mask          */

